app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 2) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 2)
---
	def show
	@user = User.find(params[:id])
	@microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('pavan', 'abc@gmail.com', '2011-05-27 04:46:28.052249', '2011-05-27 04:46:28.052249', 'd262efbd6cc174e19756f7f6561d4315b777f96195aa819653c63fb0e08930a8', '061f16ae1495b1eee5eca9bd5f7b16caea7ada1684d5f8451391f80e2e76a8ab', 'f')
---
	def create
	@user = User.new(params[:user])
		if @user.save

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
---
	def index
	@title = "All users"
	@users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "encrypted_password" = '12b009850279e4291260e8bb4244352182df5d23f3ad22ca486195087ab853d7', "updated_at" = '2011-05-27 04:47:04.161625' WHERE "users"."id" = 2
---
	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params[:user])